<a href="https://colab.research.google.com/github/yashrathi067/Python_PandasLibrary/blob/main/PandasDay2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
from numpy.random import default_rng
rng = default_rng()


dates = pd.date_range("20230315",
                      periods=6)

df = pd.DataFrame(rng.standard_normal((6, 4)),
                  index=dates,
                  columns=list("ABCD"))

print(df)

                   A         B         C         D
2023-03-15 -1.493109  1.644098  3.201946  0.841093
2023-03-16 -0.262867 -0.335715 -0.590778 -1.248961
2023-03-17 -1.253467 -0.839958 -0.500576  0.326647
2023-03-18 -2.332531  0.385915 -0.419196  0.177206
2023-03-19  0.082989 -1.050278  0.268596 -0.006725
2023-03-20  0.784859  0.485464  0.126775 -0.176310

In [ ]:
print("############")
df1= df.copy()

df1['E'] = [5,np.nan,100,np.nan,200,500]

print(df1)
# Check which cells are Missing (NaN)
print(df1.isna())
print(df1.isnull())

############
                   A         B         C         D      E
2023-03-15 -1.493109  1.644098  3.201946  0.841093    5.0
2023-03-16 -0.262867 -0.335715 -0.590778 -1.248961    NaN
2023-03-17 -1.253467 -0.839958 -0.500576  0.326647  100.0
2023-03-18 -2.332531  0.385915 -0.419196  0.177206    NaN
2023-03-19  0.082989 -1.050278  0.268596 -0.006725  200.0
2023-03-20  0.784859  0.485464  0.126775 -0.176310  500.0
                A      B      C      D      E
2023-03-15  False  False  False  False  False
2023-03-16  False  False  False  False   True
2023-03-17  False  False  False  False  False
2023-03-18  False  False  False  False   True
2023-03-19  False  False  False  False  False
2023-03-20  False  False  False  False  False
                A      B      C      D      E
2023-03-15  False  False  False  False  False
2023-03-16  False  False  False  False   True
2023-03-17  False  False  False  False  False
2023-03-18  False  False  False  False   True
2023-03-19  False  False  False  False  False
2023-03-20  False  False  False  False  False

In [ ]:
print(df1)
print(df1.fillna(value=df1.mean())) #filling the missing values where is NaN.

                   A         B         C         D      E
2023-03-15 -1.493109  1.644098  3.201946  0.841093    5.0
2023-03-16 -0.262867 -0.335715 -0.590778 -1.248961    NaN
2023-03-17 -1.253467 -0.839958 -0.500576  0.326647  100.0
2023-03-18 -2.332531  0.385915 -0.419196  0.177206    NaN
2023-03-19  0.082989 -1.050278  0.268596 -0.006725  200.0
2023-03-20  0.784859  0.485464  0.126775 -0.176310  500.0
                   A         B         C         D       E
2023-03-15 -1.493109  1.644098  3.201946  0.841093    5.00
2023-03-16 -0.262867 -0.335715 -0.590778 -1.248961  201.25
2023-03-17 -1.253467 -0.839958 -0.500576  0.326647  100.00
2023-03-18 -2.332531  0.385915 -0.419196  0.177206  201.25
2023-03-19  0.082989 -1.050278  0.268596 -0.006725  200.00
2023-03-20  0.784859  0.485464  0.126775 -0.176310  500.00

In [ ]:
df1=df.copy()
print(df1)
# rename column B with BBB
df1['BBB'] = df1['B']
df1.drop(['B'], axis=1,inplace=True)
print(df1)

                   A         B         C         D
2023-03-15 -1.493109  1.644098  3.201946  0.841093
2023-03-16 -0.262867 -0.335715 -0.590778 -1.248961
2023-03-17 -1.253467 -0.839958 -0.500576  0.326647
2023-03-18 -2.332531  0.385915 -0.419196  0.177206
2023-03-19  0.082989 -1.050278  0.268596 -0.006725
2023-03-20  0.784859  0.485464  0.126775 -0.176310
                   A         C         D       BBB
2023-03-15 -1.493109  3.201946  0.841093  1.644098
2023-03-16 -0.262867 -0.590778 -1.248961 -0.335715
2023-03-17 -1.253467 -0.500576  0.326647 -0.839958
2023-03-18 -2.332531 -0.419196  0.177206  0.385915
2023-03-19  0.082989  0.268596 -0.006725 -1.050278
2023-03-20  0.784859  0.126775 -0.176310  0.485464

In [ ]:
data=[[10,20000,1000,1],[20,30000,2000,2],[30,40000,3000,3]]
df=pd.DataFrame(data,columns=['empid','basicsalary','TA','deptno'],index=['A','B','C'])
print(df)

   empid  basicsalary    TA  deptno
A     10        20000  1000       1
B     20        30000  2000       2
C     30        40000  3000       3

In [ ]:
print(df.apply(lambda x: x.max()))  # apply () applies given function on ALL columns one by one

empid             30
basicsalary    40000
TA              3000
dtype: int64

In [ ]:
def findmax(x):  #by creating function
  return max(x)
df.apply(findmax)

empid             30
basicsalary    40000
TA              3000
dtype: int64

In [ ]:
print(df.iloc[:,0:2].apply(lambda x: x.min())) #to apply for particular rows only using slicing

empid             10
basicsalary    20000
dtype: int64

In [ ]:
# String column handling
s = pd.Series([10.2,"A", "B", "C", "Aaba  ", "Baca  ",
                np.nan, "  CABA", "  dog",
               "cat  "])

print(s.str.lower().str.strip())  #Functional Programming(2 functions used here)

print(s.str.endswith("a")) # case sensitive

0     NaN
1       a
2       b
3       c
4    aaba
5    baca
6     NaN
7    caba
8     dog
9     cat
dtype: object
0      NaN
1    False
2    False
3    False
4    False
5    False
6      NaN
7    False
8    False
9    False
dtype: object

In [ ]:
print(df)

   empid  basicsalary    TA
A     10        20000  1000
B     20        30000  2000
C     30        40000  3000

In [ ]:
df['Total']=df['basicsalary']+df['TA']  # add two columns and create new column
print(df)

   empid  basicsalary    TA  Total
A     10        20000  1000  21000
B     20        30000  2000  32000
C     30        40000  3000  43000

In [ ]:
print(df)

   empid  basicsalary    TA  deptno
A     10        20000  1000       1
B     20        30000  2000       2
C     30        40000  3000       3

In [ ]:
data=([1,'hr'],[2,'sales'],[3,'clerk'],[4,'analyst'])
df1=pd.DataFrame(data,columns=['deptno','deptname'],index=range(0,4))
print(df1)

   deptno deptname
0       1       hr
1       2    sales
2       3    clerk
3       4  analyst

In [ ]:
print(pd.merge(df,df1,on='deptno')) # merge function to join two tables.

   empid  basicsalary    TA  deptno deptname
0     10        20000  1000       1       hr
1     20        30000  2000       2    sales
2     30        40000  3000       3    clerk

In [ ]:
print(df.groupby('deptno')[['basicsalary']].sum())

        basicsalary
deptno
1             20000
2             30000
3             40000

In [ ]:
print(df)

   empid  basicsalary    TA  deptno
A     10        20000  1000       1
B     20        30000  2000       2
C     30        40000  3000       3

**Practice Questions:**

In [ ]:
d=pd.read_csv('/content/EmployeeAttrition (1).csv')
d1=pd.read_csv('/content/MarketArrivals.csv')
d2=pd.read_csv('/content/lung_data.csv')

In [ ]:
d2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 324 entries, 0 to 323
Data columns (total 35 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   age                               324 non-null    float64
 1   gender                            324 non-null    int64
 2   city                              324 non-null    int64
 3   asbestos exposure                 324 non-null    int64
 4   type of MM                        324 non-null    float64
 5   duration of asbestos exposure     324 non-null    float64
 6   diagnosis method                  324 non-null    int64
 7   keep side                         324 non-null    int64
 8   cytology                          324 non-null    int64
 9   duration of symptoms              324 non-null    float64
 10  dyspnoea                          324 non-null    int64
 11  ache on chest                     324 non-null    int64
 12  weakness                          324 non-null    int64
 13  habit of cigarette                324 non-null    int64
 14  performance status                324 non-null    int64
 15  white blood                       324 non-null    float64
 16  cell count (WBC)                  324 non-null    int64
 17  hemoglobin (HGB)                  324 non-null    int64
 18  platelet count (PLT)              324 non-null    float64
 19  sedimentation                     324 non-null    float64
 20  blood lactic dehydrogenise (LDH)  324 non-null    float64
 21  alkaline phosphatise (ALP)        324 non-null    float64
 22  total protein                     324 non-null    float64
 23  albumin                           324 non-null    float64
 24  glucose                           324 non-null    float64
 25  pleural lactic dehydrogenise      324 non-null    float64
 26  pleural protein                   324 non-null    float64
 27  pleural albumin                   324 non-null    float64
 28  pleural glucose                   324 non-null    float64
 29  dead or not                       324 non-null    int64
 30  pleural effusion                  324 non-null    float64
 31  pleural thickness on tomography   324 non-null    float64
 32  pleural level of acidity (pH)     324 non-null    float64
 33  C-reactive protein (CRP)          324 non-null    int64
 34  class of diagnosis                324 non-null    int64
dtypes: float64(19), int64(16)
memory usage: 88.7 KB

In [ ]:
df1=d.copy()
df2=d1.copy()
df3=d2.copy()
print(df1.isnull()) #to check null values
print(df2.isnull())
print(df3.isnull())

        Age  Attrition  BusinessTravel  DailyRate  Department  \
0     False      False           False      False       False
1     False      False           False      False       False
2     False      False           False      False       False
3     False      False           False      False       False
4     False      False           False      False       False
...     ...        ...             ...        ...         ...
1465  False      False           False      False       False
1466  False      False           False      False       False
1467  False      False           False      False       False
1468  False      False           False      False       False
1469  False      False           False      False       False

      DistanceFromHome  Education  EducationField  EmployeeCount  \
0                False      False           False          False
1                False      False           False          False
2                False      False           False          False
3                False      False           False          False
4                False      False           False          False
...                ...        ...             ...            ...
1465             False      False           False          False
1466             False      False           False          False
1467             False      False           False          False
1468             False      False           False          False
1469             False      False           False          False

      EmployeeNumber  ...  RelationshipSatisfaction  StandardHours  \
0              False  ...                     False          False
1              False  ...                     False          False
2              False  ...                     False          False
3              False  ...                     False          False
4              False  ...                     False          False
...              ...  ...                       ...            ...
1465           False  ...                     False          False
1466           False  ...                     False          False
1467           False  ...                     False          False
1468           False  ...                     False          False
1469           False  ...                     False          False

      StockOptionLevel  TotalWorkingYears  TrainingTimesLastYear  \
0                False              False                  False
1                False              False                  False
2                False              False                  False
3                False              False                  False
4                False              False                  False
...                ...                ...                    ...
1465             False              False                  False
1466             False              False                  False
1467             False              False                  False
1468             False              False                  False
1469             False              False                  False

      WorkLifeBalance  YearsAtCompany  YearsInCurrentRole  \
0               False           False               False
1               False           False               False
2               False           False               False
3               False           False               False
4               False           False               False
...               ...             ...                 ...
1465            False           False               False
1466            False           False               False
1467            False           False               False
1468            False           False               False
1469            False           False               False

      YearsSinceLastPromotion  YearsWithCurrManager
0                       False                 False
1                       False                 False
2                       False                 False
3                       False                 False
4                       False                 False
...                       ...                   ...
1465                    False                 False
1466                    False                 False
1467                    False                 False
1468                    False                 False
1469                    False                 False

[1470 rows x 35 columns]
       market  month   year  quantity  priceMin  priceMax  priceMod  state  \
0       False  False  False     False     False     False     False  False
1       False  False  False     False     False     False     False  False
2       False  False  False     False     False     False     False  False
3       False  False  False     False     False     False     False  False
4       False  False  False     False     False     False     False  False
...       ...    ...    ...       ...       ...       ...       ...    ...
10222   False  False  False     False     False     False     False  False
10223   False  False  False     False     False     False     False  False
10224   False  False  False     False     False     False     False  False
10225   False  False  False     False     False     False     False  False
10226   False  False  False     False     False     False     False  False

        city   date
0      False  False
1      False  False
2      False  False
3      False  False
4      False  False
...      ...    ...
10222  False  False
10223  False  False
10224  False  False
10225  False  False
10226  False  False

[10227 rows x 10 columns]
       age  gender   city  asbestos exposure  type of MM  \
0    False   False  False              False       False
1    False   False  False              False       False
2    False   False  False              False       False
3    False   False  False              False       False
4    False   False  False              False       False
..     ...     ...    ...                ...         ...
319  False   False  False              False       False
320  False   False  False              False       False
321  False   False  False              False       False
322  False   False  False              False       False
323  False   False  False              False       False

     duration of asbestos exposure  diagnosis method  keep side  cytology  \
0                            False             False      False     False
1                            False             False      False     False
2                            False             False      False     False
3                            False             False      False     False
4                            False             False      False     False
..                             ...               ...        ...       ...
319                          False             False      False     False
320                          False             False      False     False
321                          False             False      False     False
322                          False             False      False     False
323                          False             False      False     False

     duration of symptoms  ...  pleural lactic dehydrogenise  pleural protein  \
0                   False  ...                         False            False
1                   False  ...                         False            False
2                   False  ...                         False            False
3                   False  ...                         False            False
4                   False  ...                         False            False
..                    ...  ...                           ...              ...
319                 False  ...                         False            False
320                 False  ...                         False            False
321                 False  ...                         False            False
322                 False  ...                         False            False
323                 False  ...                         False            False

     pleural albumin  pleural glucose  dead or not  pleural effusion  \
0              False            False        False             False
1              False            False        False             False
2              False            False        False             False
3              False            False        False             False
4              False            False        False             False
..               ...              ...          ...               ...
319            False            False        False             False
320            False            False        False             False
321            False            False        False             False
322            False            False        False             False
323            False            False        False             False

     pleural thickness on tomography  pleural level of acidity (pH)  \
0                              False                          False
1                              False                          False
2                              False                          False
3                              False                          False
4                              False                          False
..                               ...                            ...
319                            False                          False
320                            False                          False
321                            False                          False
322                            False                          False
323                            False                          False

     C-reactive protein (CRP)  class of diagnosis
0                       False               False
1                       False               False
2                       False               False
3                       False               False
4                       False               False
..                        ...                 ...
319                     False               False
320                     False               False
321                     False               False
322                     False               False
323                     False               False

[324 rows x 35 columns]

In [ ]:
print(df1.iloc[:,0].isnull())
print(df2.iloc[:,0].isnull())
print(df3.iloc[:,0].isnull())

0       False
1       False
2       False
3       False
4       False
        ...
1465    False
1466    False
1467    False
1468    False
1469    False
Name: Age, Length: 1470, dtype: bool
0        False
1        False
2        False
3        False
4        False
         ...
10222    False
10223    False
10224    False
10225    False
10226    False
Name: market, Length: 10227, dtype: bool
0      False
1      False
2      False
3      False
4      False
       ...
319    False
320    False
321    False
322    False
323    False
Name: age, Length: 324, dtype: bool

In [ ]:
df1.info()
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1470 entries, 0 to 1469
Data columns (total 35 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       1470 non-null   int64
 1   Attrition                 1470 non-null   object
 2   BusinessTravel            1470 non-null   object
 3   DailyRate                 1470 non-null   int64
 4   Department                1470 non-null   object
 5   DistanceFromHome          1470 non-null   int64
 6   Education                 1470 non-null   int64
 7   EducationField            1470 non-null   object
 8   EmployeeCount             1470 non-null   int64
 9   EmployeeNumber            1470 non-null   int64
 10  EnvironmentSatisfaction   1470 non-null   int64
 11  Gender                    1470 non-null   object
 12  HourlyRate                1470 non-null   int64
 13  JobInvolvement            1470 non-null   int64
 14  JobLevel                  1470 non-null   int64
 15  JobRole                   1470 non-null   object
 16  JobSatisfaction           1470 non-null   int64
 17  MaritalStatus             1470 non-null   object
 18  MonthlyIncome             1470 non-null   int64
 19  MonthlyRate               1470 non-null   int64
 20  NumCompaniesWorked        1470 non-null   int64
 21  Over18                    1470 non-null   object
 22  OverTime                  1470 non-null   object
 23  PercentSalaryHike         1470 non-null   int64
 24  PerformanceRating         1470 non-null   int64
 25  RelationshipSatisfaction  1470 non-null   int64
 26  StandardHours             1470 non-null   int64
 27  StockOptionLevel          1470 non-null   int64
 28  TotalWorkingYears         1470 non-null   int64
 29  TrainingTimesLastYear     1470 non-null   int64
 30  WorkLifeBalance           1470 non-null   int64
 31  YearsAtCompany            1470 non-null   int64
 32  YearsInCurrentRole        1470 non-null   int64
 33  YearsSinceLastPromotion   1470 non-null   int64
 34  YearsWithCurrManager      1470 non-null   int64
dtypes: int64(26), object(9)
memory usage: 402.1+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 324 entries, 0 to 323
Data columns (total 35 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   age                               324 non-null    float64
 1   gender                            324 non-null    int64
 2   city                              324 non-null    int64
 3   asbestos exposure                 324 non-null    int64
 4   type of MM                        324 non-null    float64
 5   duration of asbestos exposure     324 non-null    float64
 6   diagnosis method                  324 non-null    int64
 7   keep side                         324 non-null    int64
 8   cytology                          324 non-null    int64
 9   duration of symptoms              324 non-null    float64
 10  dyspnoea                          324 non-null    int64
 11  ache on chest                     324 non-null    int64
 12  weakness                          324 non-null    int64
 13  habit of cigarette                324 non-null    int64
 14  performance status                324 non-null    int64
 15  white blood                       324 non-null    float64
 16  cell count (WBC)                  324 non-null    int64
 17  hemoglobin (HGB)                  324 non-null    int64
 18  platelet count (PLT)              324 non-null    float64
 19  sedimentation                     324 non-null    float64
 20  blood lactic dehydrogenise (LDH)  324 non-null    float64
 21  alkaline phosphatise (ALP)        324 non-null    float64
 22  total protein                     324 non-null    float64
 23  albumin                           324 non-null    float64
 24  glucose                           324 non-null    float64
 25  pleural lactic dehydrogenise      324 non-null    float64
 26  pleural protein                   324 non-null    float64
 27  pleural albumin                   324 non-null    float64
 28  pleural glucose                   324 non-null    float64
 29  dead or not                       324 non-null    int64
 30  pleural effusion                  324 non-null    float64
 31  pleural thickness on tomography   324 non-null    float64
 32  pleural level of acidity (pH)     324 non-null    float64
 33  C-reactive protein (CRP)          324 non-null    int64
 34  class of diagnosis                324 non-null    int64
dtypes: float64(19), int64(16)
memory usage: 88.7 KB

In [ ]:
print("mean is:")
print()
print(df3.mean())
print()
print("median is:") # not object data type

print(df3.median())

mean is:

age                                   54.743827
gender                                 0.586420
city                                   2.530864
asbestos exposure                      0.864198
type of MM                             0.052469
duration of asbestos exposure         30.188272
diagnosis method                       0.703704
keep side                              0.759259
cytology                               0.280864
duration of symptoms                   5.442901
dyspnoea                               0.817901
ache on chest                          0.682099
weakness                               0.611111
habit of cigarette                     0.910494
performance status                     0.521605
white blood                         9457.453704
cell count (WBC)                       9.558642
hemoglobin (HGB)                       0.422840
platelet count (PLT)                 369.651235
sedimentation                         70.685185
blood lactic dehydrogenise (LDH)     308.913580
alkaline phosphatise (ALP)            66.163580
total protein                          6.583796
albumin                                3.301142
glucose                              112.410494
pleural lactic dehydrogenise         518.472222
pleural protein                        3.937562
pleural albumin                        2.076883
pleural glucose                       48.444444
dead or not                            0.944444
pleural effusion                       0.870370
pleural thickness on tomography        0.595679
pleural level of acidity (pH)          0.521605
C-reactive protein (CRP)              64.188272
class of diagnosis                     1.296296
dtype: float64

median is:
age                                   55.0
gender                                 1.0
city                                   2.0
asbestos exposure                      1.0
type of MM                             0.0
duration of asbestos exposure         34.0
diagnosis method                       1.0
keep side                              1.0
cytology                               0.0
duration of symptoms                   5.0
dyspnoea                               1.0
ache on chest                          1.0
weakness                               1.0
habit of cigarette                     0.0
performance status                     1.0
white blood                         8757.5
cell count (WBC)                       9.0
hemoglobin (HGB)                       0.0
platelet count (PLT)                 345.0
sedimentation                         68.0
blood lactic dehydrogenise (LDH)     234.5
alkaline phosphatise (ALP)            62.0
total protein                          6.6
albumin                                3.4
glucose                              104.0
pleural lactic dehydrogenise         510.0
pleural protein                        4.2
pleural albumin                        2.2
pleural glucose                       38.0
dead or not                            1.0
pleural effusion                       1.0
pleural thickness on tomography        1.0
pleural level of acidity (pH)          1.0
C-reactive protein (CRP)              68.0
class of diagnosis                     1.0
dtype: float64

In [ ]:
df1['ageis']=df1['Age']
print(df1)

      Age Attrition     BusinessTravel  DailyRate              Department  \
0      41       Yes      Travel_Rarely       1102                   Sales
1      49        No  Travel_Frequently        279  Research & Development
2      37       Yes      Travel_Rarely       1373  Research & Development
3      33        No  Travel_Frequently       1392  Research & Development
4      27        No      Travel_Rarely        591  Research & Development
...   ...       ...                ...        ...                     ...
1465   36        No  Travel_Frequently        884  Research & Development
1466   39        No      Travel_Rarely        613  Research & Development
1467   27        No      Travel_Rarely        155  Research & Development
1468   49        No  Travel_Frequently       1023                   Sales
1469   34        No      Travel_Rarely        628  Research & Development

      DistanceFromHome  Education EducationField  EmployeeCount  \
0                    1          2  Life Sciences              1
1                    8          1  Life Sciences              1
2                    2          2          Other              1
3                    3          4  Life Sciences              1
4                    2          1        Medical              1
...                ...        ...            ...            ...
1465                23          2        Medical              1
1466                 6          1        Medical              1
1467                 4          3  Life Sciences              1
1468                 2          3        Medical              1
1469                 8          3        Medical              1

      EmployeeNumber  ...  StandardHours StockOptionLevel  TotalWorkingYears  \
0                  1  ...             80                0                  8
1                  2  ...             80                1                 10
2                  4  ...             80                0                  7
3                  5  ...             80                0                  8
4                  7  ...             80                1                  6
...              ...  ...            ...              ...                ...
1465            2061  ...             80                1                 17
1466            2062  ...             80                1                  9
1467            2064  ...             80                1                  6
1468            2065  ...             80                0                 17
1469            2068  ...             80                0                  6

      TrainingTimesLastYear  WorkLifeBalance YearsAtCompany  \
0                         0                1              6
1                         3                3             10
2                         3                3              0
3                         3                3              8
4                         3                3              2
...                     ...              ...            ...
1465                      3                3              5
1466                      5                3              7
1467                      0                3              6
1468                      3                2              9
1469                      3                4              4

      YearsInCurrentRole YearsSinceLastPromotion  YearsWithCurrManager  ageis
0                      4                       0                     5     41
1                      7                       1                     7     49
2                      0                       0                     0     37
3                      7                       3                     0     33
4                      2                       2                     2     27
...                  ...                     ...                   ...    ...
1465                   2                       0                     3     36
1466                   7                       1                     7     39
1467                   2                       0                     3     27
1468                   6                       0                     8     49
1469                   3                       1                     2     34

[1470 rows x 36 columns]

In [ ]:
print(df1.drop(['ageis'],axis=1,inplace=True))

None

In [ ]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1470 entries, 0 to 1469
Data columns (total 35 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       1470 non-null   int64
 1   Attrition                 1470 non-null   object
 2   BusinessTravel            1470 non-null   object
 3   DailyRate                 1470 non-null   int64
 4   Department                1470 non-null   object
 5   DistanceFromHome          1470 non-null   int64
 6   Education                 1470 non-null   int64
 7   EducationField            1470 non-null   object
 8   EmployeeCount             1470 non-null   int64
 9   EmployeeNumber            1470 non-null   int64
 10  EnvironmentSatisfaction   1470 non-null   int64
 11  Gender                    1470 non-null   object
 12  HourlyRate                1470 non-null   int64
 13  JobInvolvement            1470 non-null   int64
 14  JobLevel                  1470 non-null   int64
 15  JobRole                   1470 non-null   object
 16  JobSatisfaction           1470 non-null   int64
 17  MaritalStatus             1470 non-null   object
 18  MonthlyIncome             1470 non-null   int64
 19  MonthlyRate               1470 non-null   int64
 20  NumCompaniesWorked        1470 non-null   int64
 21  Over18                    1470 non-null   object
 22  OverTime                  1470 non-null   object
 23  PercentSalaryHike         1470 non-null   int64
 24  PerformanceRating         1470 non-null   int64
 25  RelationshipSatisfaction  1470 non-null   int64
 26  StandardHours             1470 non-null   int64
 27  StockOptionLevel          1470 non-null   int64
 28  TotalWorkingYears         1470 non-null   int64
 29  TrainingTimesLastYear     1470 non-null   int64
 30  WorkLifeBalance           1470 non-null   int64
 31  YearsAtCompany            1470 non-null   int64
 32  YearsInCurrentRole        1470 non-null   int64
 33  YearsSinceLastPromotion   1470 non-null   int64
 34  YearsWithCurrManager      1470 non-null   int64
dtypes: int64(26), object(9)
memory usage: 402.1+ KB

In [ ]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10227 entries, 0 to 10226
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   market    10227 non-null  object
 1   month     10227 non-null  object
 2   year      10227 non-null  int64
 3   quantity  10227 non-null  int64
 4   priceMin  10227 non-null  int64
 5   priceMax  10227 non-null  int64
 6   priceMod  10227 non-null  int64
 7   state     10227 non-null  object
 8   city      10227 non-null  object
 9   date      10227 non-null  object
dtypes: int64(5), object(5)
memory usage: 799.1+ KB

Market Arrivals Questions Practice

Q1. For every market find average qunatity of wheat

Q2. Find average quantity of wheat for every market in month of january

Q3. Find name of the market which is having highest priceMax in month of november

Q4. Compare average priceMax for state PB and MP

Q5. Find the year when maximum total quantity was traded

Q6. Find market in India which has maximum frequency of trading.

In [ ]:
print(df2.groupby('market')[['quantity']].mean()) #Q1

                     quantity
market
ABOHAR(PB)         918.411111
AGRA(UP)         46267.721805
AHMEDABAD(GUJ)   83698.728000
AHMEDNAGAR(MS)   97115.430556
AJMER(RAJ)        6286.933333
...                       ...
UDAIPUR(RAJ)      5623.148649
UJJAIN(MP)        7686.772727
VANI(MS)         21975.500000
VARANASI(UP)     41401.526316
YEOLA(MS)       134226.746575

[120 rows x 1 columns]

In [ ]:
df2.describe()

               year      quantity      priceMin      priceMax      priceMod
count  10227.000000  1.022700e+04  10227.000000  10227.000000  10227.000000
mean    2009.022294  7.660488e+04    646.944363   1212.760731    984.284345
std        4.372841  1.244087e+05    673.121850    979.658874    818.471498
min     1996.000000  2.000000e+01     16.000000    145.000000     80.000000
25%     2006.000000  8.898000e+03    209.000000    557.000000    448.000000
50%     2009.000000  2.746000e+04    440.000000    923.000000    747.000000
75%     2013.000000  8.835650e+04    828.000000   1527.000000   1248.000000
max     2016.000000  1.639032e+06   6000.000000   8192.000000   6400.000000

In [ ]:
print(df2.groupby('market')[['priceMax']].max().period.month)

                priceMax
market
ABOHAR(PB)          5109
AGRA(UP)            4468
AHMEDABAD(GUJ)      5068
AHMEDNAGAR(MS)      6300
AJMER(RAJ)          4861
...                  ...
UDAIPUR(RAJ)        4860
UJJAIN(MP)          5000
VANI(MS)            4658
VARANASI(UP)        4461
YEOLA(MS)           5038

[120 rows x 1 columns]

In [ ]:
d1.dtypes

market      object
month       object
year         int64
quantity     int64
priceMin     int64
priceMax     int64
priceMod     int64
state       object
city        object
date        object
dtype: object

In [ ]:
d1.loc[d1['month'] == 'January',:].groupby('market')['quantity'].mean() #Q2

market
ABOHAR(PB)           967.500000
AGRA(UP)           53761.666667
AHMEDABAD(GUJ)    103115.090909
AHMEDNAGAR(MS)    143425.307692
AJMER(RAJ)          3271.000000
                      ...
UDAIPUR(RAJ)        5313.428571
UJJAIN(MP)          1627.000000
VANI(MS)           33692.555556
VARANASI(UP)       35033.333333
YEOLA(MS)         258187.615385
Name: quantity, Length: 105, dtype: float64

In [ ]:
d1.loc[d1['month']=='November',:].groupby('market')['priceMax'].max() #Q3

market
ABOHAR(PB)        3600
AGRA(UP)          3718
AHMEDABAD(GUJ)    4100
AHMEDNAGAR(MS)    4045
AJMER(RAJ)        2506
                  ...
UDAIPUR(RAJ)      3267
UJJAIN(MP)        1600
VANI(MS)          3342
VARANASI(UP)      2705
YEOLA(MS)         2960
Name: priceMax, Length: 108, dtype: int64

In [ ]:
#Q4: Compare average priceMax for state PB and MP
d1.loc[d1['state'].isin(['PB','MP'])].groupby('state')['priceMax'].mean()

state
MP     998.611650
PB    1384.215852
Name: priceMax, dtype: float64

In [ ]:
#Q5: Find the year when maximum total quantity was traded
d1.groupby('year')['quantity'].sum().sort_values(ascending=False)

market
BANGALORE             76491944
PUNE(MS)              59470570
LASALGAON(MS)         58765209
PIMPALGAON(MS)        53231396
DELHI                 46305615
                        ...
ETAWAH(UP)                 590
SRIGANGANAGAR(RAJ)         400
CHALLAKERE(KNT)            350
MEERUT(UP)                 265
MIDNAPUR(WB)               120
Name: quantity, Length: 120, dtype: int64

In [ ]:
# Q6:Find market in India which has maximum frequency of trading. #count()
d1.groupby('market')['state'].count().sort_values(ascending=False)

market
LASALGAON(MS)         242
PIMPALGAON(MS)        224
MANMAD(MS)            218
LONAND(MS)            211
MAHUVA(GUJ)           210
                     ...
RAJAHMUNDRY(AP)         1
SRIGANGANAGAR(RAJ)      1
MEERUT(UP)              1
CHALLAKERE(KNT)         1
NEEMUCH(MP)             1
Name: state, Length: 120, dtype: int64